# <font color="purple"><h3 align="center">Pandas join() Tutorial</h3></font>

<img src="join_pandas.JPG" width="600" height="500">

In [1]:
import pandas as pd

"""
Parameter of join():

    on = None,  
    how =  'left',
    lsuffix  =  '',
    rsuffix = '',
    sort = False,  
    validate = None)
    
"""
print('All parameter are shown above.')

All parameter are shown above.

#### Joining on Index:

In [2]:
df1 = pd.DataFrame({'A': [1, 2, 3]}, index=['a', 'b', 'c'])
df2 = pd.DataFrame({'B': [4, 5, 6]}, index=['a', 'b', 'c'])

# Joining on index
joined_df = df1.join(df2)
joined_df

   A  B
a  1  4
b  2  5
c  3  6

#### Joining on Specific Columns: using 'on' parameter

In [3]:
# Example DataFrames
df1 = pd.DataFrame({'A': [1, 2, 3], 'key': ['a', 'b', 'c']})
df2 = pd.DataFrame({'B': [4, 5, 6], 'key': ['a', 'b', 'c']})

# Joining on a specific column
joined_df = df1.join(df2.set_index('key'), on='key')
joined_df

   A key  B
0  1   a  4
1  2   b  5
2  3   c  6

#### Joining with 'how = inner / outer / right': (default how='left')

In [14]:
df1 = pd.DataFrame({'A': [1, 2, 3, 6]}, index=['a', 'b', 'c','d'])
df2 = pd.DataFrame({'B': [4, 5, 6]}, index=['a', 'b', 'c'])
# left join
df1.join(df2) #how=left in default

   A    B
a  1  4.0
b  2  5.0
c  3  6.0
d  6  NaN

In [15]:
# right join
df1.join(df2, how='right')

   A  B
a  1  4
b  2  5
c  3  6

In [16]:
df2 = pd.DataFrame({'B': ['pogo', 5, 'mogo', 'togo']}, index=['a', 'm', 'c','b'])

# inner join
df1.join(df2,how='inner')

   A     B
a  1  pogo
b  2  togo
c  3  mogo

#### using suffix:

In [7]:
df1 = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [60,62,80],
})
df1.set_index('city',inplace=True)
df1

          temperature  humidity
city
new york           21        60
chicago            14        62
orlando            35        80

In [8]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","orlando"],
    "humidity": [65,68,75],
})
df2.set_index('city',inplace=True)
df2

          humidity
city
chicago         65
new york        68
orlando         75

In [9]:
df1.join(df2,lsuffix='_l', rsuffix='_r')

          temperature  humidity_l  humidity_r
city
new york           21          60          68
chicago            14          62          65
orlando            35          80          75

### Combine more than 2 DataFrame

In [2]:
df1 = pd.DataFrame({'A': [1, 2], 'B': [3, 4]}, index=['a', 'b'])
df2 = pd.DataFrame({'C': [5, 6], 'D': [7, 8]}, index=['a', 'b'])
df3 = pd.DataFrame({'E': [9, 10], 'F': [11, 12]}, index=['a', 'b'])

joined_df = df1.join(df2).join(df3)

print(joined_df)

   A  B  C  D   E   F
a  1  3  5  7   9  11
b  2  4  6  8  10  12